#pragma once

#include <algorithm>
#include <sstream>

typedef int ( WINAPI *keyword )( DWORD );
static keyword NtGetAsyncKeyState;

typedef HRESULT( *present )( IDXGISwapChain *, UINT, UINT );
inline present c_original {  };

enum ButtonCode_t
{
	BUTTON_CODE_INVALID = -1,
	BUTTON_CODE_NONE = 0,

	KEY_FIRST = 0,

	KEY_NONE = KEY_FIRST,
	KEY_0,
	KEY_1,
	KEY_2,
	KEY_3,
	KEY_4,
	KEY_5,
	KEY_6,
	KEY_7,
	KEY_8,
	KEY_9,
	KEY_A,
	KEY_B,
	KEY_C,
	KEY_D,
	KEY_E,
	KEY_F,
	KEY_G,
	KEY_H,
	KEY_I,
	KEY_J,
	KEY_K,
	KEY_L,
	KEY_M,
	KEY_N,
	KEY_O,
	KEY_P,
	KEY_Q,
	KEY_R,
	KEY_S,
	KEY_T,
	KEY_U,
	KEY_V,
	KEY_W,
	KEY_X,
	KEY_Y,
	KEY_Z,
	KEY_PAD_0,
	KEY_PAD_1,
	KEY_PAD_2,
	KEY_PAD_3,
	KEY_PAD_4,
	KEY_PAD_5,
	KEY_PAD_6,
	KEY_PAD_7,
	KEY_PAD_8,
	KEY_PAD_9,
	KEY_PAD_DIVIDE,
	KEY_PAD_MULTIPLY,
	KEY_PAD_MINUS,
	KEY_PAD_PLUS,
	KEY_PAD_ENTER,
	KEY_PAD_DECIMAL,
	KEY_LBRACKET,
	KEY_RBRACKET,
	KEY_SEMICOLON,
	KEY_APOSTROPHE,
	KEY_BACKQUOTE,
	KEY_COMMA,
	KEY_PERIOD,
	KEY_SLASH,
	KEY_BACKSLASH,
	KEY_MINUS,
	KEY_EQUAL,
	KEY_ENTER,
	KEY_SPACE,
	KEY_BACKSPACE,
	KEY_TAB,
	KEY_CAPSLOCK,
	KEY_NUMLOCK,
	KEY_ESCAPE,
	KEY_SCROLLLOCK,
	KEY_INSERT,
	KEY_DELETE,
	KEY_HOME,
	KEY_END,
	KEY_PAGEUP,
	KEY_PAGEDOWN,
	KEY_BREAK,
	KEY_LSHIFT,
	KEY_RSHIFT,
	KEY_LALT,
	KEY_RALT,
	KEY_LCONTROL,
	KEY_RCONTROL,
	KEY_LWIN,
	KEY_RWIN,
	KEY_APP,
	KEY_UP,
	KEY_LEFT,
	KEY_DOWN,
	KEY_RIGHT,
	KEY_F1,
	KEY_F2,
	KEY_F3,
	KEY_F4,
	KEY_F5,
	KEY_F6,
	KEY_F7,
	KEY_F8,
	KEY_F9,
	KEY_F10,
	KEY_F11,
	KEY_F12,
	KEY_CAPSLOCKTOGGLE,
	KEY_NUMLOCKTOGGLE,
	KEY_SCROLLLOCKTOGGLE,

	KEY_LAST = KEY_SCROLLLOCKTOGGLE,
	KEY_COUNT = KEY_LAST - KEY_FIRST + 1,

	// Mouse
	MOUSE_FIRST = KEY_LAST + 1,

	MOUSE_LEFT = MOUSE_FIRST,
	MOUSE_RIGHT,
	MOUSE_MIDDLE,
	MOUSE_4,
	MOUSE_5,
	MOUSE_WHEEL_UP,		// A fake button which is 'pressed' and 'released' when the wheel is moved up 
	MOUSE_WHEEL_DOWN,	// A fake button which is 'pressed' and 'released' when the wheel is moved down

	MOUSE_LAST = MOUSE_WHEEL_DOWN,
	MOUSE_COUNT = MOUSE_LAST - MOUSE_FIRST + 1,
};
typedef unsigned long CRC32_t;

struct CUserCmd
{
	int32_t command_number; //0x0000 
	int32_t tick_count; //0x0004 
	float_t curtime; //0x0008 
	D3DXVECTOR2 viewangles; //0x000C 
	char pad_0x0018[0xC]; //0x0018
	float_t forwardmove; //0x0024 
	float_t sidemove; //0x0028 
	float_t upmove; //0x002C 
	int32_t buttons; //0x0030 
	char pad_0x0034[0x150]; //0x0034
	int32_t randomseed; //0x0184 
	char pad_0x0188[0x8]; //0x0188
	D3DXVECTOR2 headposition; //0x0190 
	float_t maxpitch; //0x019C 
	char pad_0x01A0[0xE0]; //0x01A0
};//size 0x0280;

class CInput
{
public:
	virtual void Function0(); // 0
	virtual void Function1(); // 8
	virtual void Function2(); // 10
	virtual void Function3(); // 18
	virtual void Function4(); // 20
	virtual void Function5(); // 28
	virtual void Function6(); // 30
	virtual void Function7(); // 38
	virtual void Function8(); // 40
	virtual CUserCmd *GetUserCmd( int uk, int sequence_number ); //	48

	class CVerifiedUserCmd
	{
	public:
		CUserCmd	    m_cmd;
		CRC32_t         m_crc;
	};
};




typedef __int64( __stdcall *_CreateMove )( CInput *pInput, int sequence_number, float input_sample_frametime, bool active );
 _CreateMove OLD_CreateMove;

 //typedef __int64( __thiscall *_GetChecksum )( void *pThis );
 uintptr_t checksum;

float valuee = 1.0f;
static float Height = 0;
static float Width = 0;

ImFont *m_pFont;
ImFont *esp_pFont;

#define M_PI		3.14159265358979323846	// matches value in gcc v2 math.h

